src/cf/src/DataProcessors/VentesEnDetail/VentesEnDetail.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>VentesEnDetail</name>
  <attributes>
    <name>Organisation</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>TabularSection</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/cf/src/Documents/СертификатНаОплату/СертификатНаОплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СертификатНаОплату</name>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <attributes>
    <name>Поступление</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Document>

src/cf/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПриходныйДокументПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДополнительныеРасходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/TypesDePayment/TypesDePayment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>TypesDePayment</name>
  <predefined>
    <items>
      <name>Сертификат</name>
      <description>Bon d'achat</description>
    </items>
    <items>
      <name>CarteBanquaire</name>
      <description>Carte bancaire</description>
    </items>
    <items>
      <name>Cheque</name>
      <description>Cheque</description>
    </items>
    <items>
      <name>Credit</name>
      <description>Credit</description>
    </items>
    <items>
      <name>Cash</name>
      <description>Espèces</description>
    </items>
    <items>
      <name>VirementBanquaire</name>
      <description>Virement bancaire</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/cf/src/DataProcessors/VentesEnDetail/Forms/ФормаСложнойОплаты/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте
Перем ЦветФонаСдачи;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	//ВидОперацииПродажа = Перечисления.ВидыОперацийЧекККМ.Продажа;
	
	КоличествоСимволовПослеЗапятой = 2;
	ПервыйВвод = Истина;
	
	Параметры.Свойство("ИтогПоОрганизации", ИтогПоОрганизации);
	Параметры.Свойство("Организация"      , Организация);
	Параметры.Свойство("ХозяйственнаяОперация"      , ВидОперации);
	Если Параметры.Свойство("РозничныйКлиент") Тогда 
		Элементы.КомандаКредит.Видимость = Не Параметры.РозничныйКлиент = Справочники.Контрагенты.CLIENT_DE_PASSAGE;
	КонецЕсли;
	//Параметры.Свойство("ЧекККМПродажа"    , ЧекККМПродажа);
	
	//Если ИтогПоОрганизации = 0 Тогда
	//	Отказ = Истина;
	//Иначе
		СуммаОплаты   = ИтогПоОрганизации;
		СуммаСдачи    = 0;
		ВводимоеЧисло = Формат(СуммаОплаты, "ЧЦ=15; ЧДЦ=2; ЧГ=3,0");
		
	//КонецЕсли;
	
	ПечатьЧека = Истина;
	УправлениеВидимостьюИДоступностью();
	
	//Если ВидОперации = Перечисления.ВидыОперацийЧекККМ.Продажа Тогда
		Элементы.ДекорацияЗаголовок.Заголовок = НСтр("en = 'Paiement:'; es = 'Paiement:'; fr = 'Paiement:'; ru = 'Платеж:'") + " " + Организация.Наименование;
	//Иначе
	//	Элементы.ДекорацияЗаголовок.Заголовок = НСтр("en = 'Refund of payment:'; fr = 'Remboursement du paiement:'; ru = 'Возврат оплаты:'; es = 'Reembolso del pago:'") + " " + Организация.Наименование;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//Если НЕ СанкционированноеЗакрытие Тогда
	//	
	//	Если ЗавершениеРаботы Тогда
	//		Отказ = Истина;
	//		Возврат;
	//	КонецЕсли;
	//	
	//	СтруктураПоиска = Новый Структура;
	//	СтруктураПоиска.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта"));
	//	
	//	СтрокиВыбранныхОплат = ТекущиеВидыОплат.НайтиСтроки(СтруктураПоиска);
	//	
	//	ПараметрДействия = Новый Структура;
	//	ПараметрДействия.Вставить("ОткрытаБлокирующаяФорма", Ложь);
	//	ПараметрДействия.Вставить("Закрыть");
	//	
	//	//Если СтрокиВыбранныхОплат.Количество() > 0 Тогда
	//	//	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЧекККМ.Продажа") Тогда
	//	//		
	//	//		ЗаголовокИнформации = НСтр("en = 'The payment information has been sent to the bank.'; fr = 'Les détails de paiement sont envoyés à la banque.'; ru = 'Данные об оплате отправлены в банк.'; es = 'Los datos de pago se envían al banco.'");
	//	//		ТекстВопроса =  НСтр("en = 'It is necessary to perform the reverse of the performed operations.'; fr = ""Il est nécessaire d'effectuer les opérations effectuées à l'avance.""; ru = 'Необходимо выполнить сторно произведенных операций.'; es = 'Es necesario realizar las operaciones realizadas.'"); 
	//	//		
	//	//		ОбщегоНазначенияРТКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, ТекстВопроса);
	//	//		Отказ = Истина;
	//	//		
	//	//	Иначе
	//	//		
	//	//		ЗаголовокИнформации = НСтр("en = 'The cancellation information has been sent to the bank.'; fr = ""Les données d'annulation sont envoyées à la banque.""; ru = 'Данные об отмене отправлены в банк.'; es = 'Los datos de cancelación se envían al banco.'");
	//	//		ТекстВопроса =  НСтр("en = 'Do you want to close the data loss window?'; fr = 'Voulez-vous fermer la fenêtre avec la perte de données?'; ru = 'Вы хотите закрыть окно с потерей данных?'; es = '¿Desea cerrar la ventana con pérdida de datos?'"); 
	//	//		
	//	//		ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуВопросаОПотереДанныхПередЗакрытием", ЭтотОбъект);
	//	//		ОбщегоНазначенияРТКлиент.ВывестиВопросДляРМКУправляемой(ЗаголовокИнформации, ТекстВопроса, "Нет", ОбработчикОповещения);
	//	//		Отказ = Истина;
	//	//		
	//	//	КонецЕсли;
	//	//КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	//Если ВидОперации = ВидОперацииПродажа Тогда
	//	// ПодключаемоеОборудование
	//	ПоддерживаемыеТипыВО = Новый Массив();
	//	ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
	//	ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
	//	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(, ЭтотОбъект, ПоддерживаемыеТипыВО);
	//	// Конец ПодключаемоеОборудование
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	//Если ВводДоступен()
	//	И ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЧекККМ.Продажа") Тогда
	//	ПодключаемоеОборудованиеРТКлиент.ВнешнееСобытиеОборудованияРМК(ЭтотОбъект, Источник, Событие, Данные);
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидыОплатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОбработкаВыбораВидыОплаты(ВидыОплат.НайтиПоИдентификатору(ВыбраннаяСтрока));
	
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ТекущиеВидыОплатПриАктивизацииСтроки(Элемент)
	Если ТекущийЭлемент = Элементы.ТекущиеВидыОплат Тогда
		ПервыйВвод = Истина;
		
		Для каждого СтрокаОплаты Из ТекущиеВидыОплат Цикл
			СуммаОплатыЧисло = ПривестиСтрокуКЧислу(СтрокаОплаты.ПредставлениеСуммы, Истина);
			СтрокаОплаты.Сумма = СуммаОплатыЧисло;
			Если СуммаОплатыЧисло = 0 Тогда
				СтрокаОплаты.ПредставлениеСуммы = "";
			Иначе
				СтрокаОплаты.ПредставлениеСуммы = Формат(СуммаОплатыЧисло, "ЧДЦ=2");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда0(Команда)
	
	ДобавитьЦифру("0")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	ДобавитьЦифру("1")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	
	ДобавитьЦифру("2")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда3(Команда)
	
	ДобавитьЦифру("3")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда4(Команда)
	
	ДобавитьЦифру("4")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда5(Команда)
	
	ДобавитьЦифру("5")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда6(Команда)
	
	ДобавитьЦифру("6")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда7(Команда)
	
	ДобавитьЦифру("7")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8(Команда)
	
	ДобавитьЦифру("8")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9(Команда)
	
	ДобавитьЦифру("9")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда0ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("0")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("1")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда2ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("2")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда3ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("3")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда4ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("4")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда5ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("5")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда6ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("6")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда7ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("7")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("8")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("9")
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаТочка(Команда)
	
	ТекущаяСтрокаОплаты = Элементы.ТекущиеВидыОплат.ТекущиеДанные;
	
	Если ТекущаяСтрокаОплаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если (ТекущаяСтрокаОплаты.ЗапретРедактирования) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПервыйВвод Тогда
		ТекущаяСтрокаОплаты.ПредставлениеСуммы = "";
		ПервыйВвод = Ложь;
	КонецЕсли;
	
	Если ТекущаяСтрокаОплаты.ПредставлениеСуммы = "" Тогда
		ТекущаяСтрокаОплаты.ПредставлениеСуммы = "0";
	КонецЕсли;
	
	ЧислоВхождений = СтрЧислоВхождений(ТекущаяСтрокаОплаты.ПредставлениеСуммы, ",");
	
	Если Не ЧислоВхождений > 0 Тогда
		ТекущаяСтрокаОплаты.ПредставлениеСуммы = ТекущаяСтрокаОплаты.ПредставлениеСуммы + ",";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтереть(Команда)
	
	ТекущаяСтрокаОплаты = Элементы.ТекущиеВидыОплат.ТекущиеДанные;
	
	Если ТекущаяСтрокаОплаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//ТипОплаты = ТекущаяСтрокаОплаты.ТипОплаты;
	//
	//Если ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта") 
	//	ИЛИ ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.ПодарочныйСертификат") Тогда
	//
	//	УдалениеСтроки(ТекущаяСтрокаОплаты)
	//Иначе
		ТекущаяСтрокаОплаты.ПредставлениеСуммы = "";
		ПервыйВвод = Ложь;
		
		ТекущаяСтрокаОплаты.Сумма = 0;
		
		ОбновитьФорму();
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаEnter(Команда)
	
	ПервыйВвод = Истина;
	
	ПодготовитьТаблицыКПередаче();
	
	Сдача = Оплата.Итог("Сумма") - ИтогПоОрганизации;
	
	Если Сдача < 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Оплата.Итог("Сумма") = 0 и ИтогПоОрганизации>0 Тогда
		
		ЗаголовокИнформации = НСтр("en = 'Erreur de vérification du paiement!'; es = 'Erreur de vérification du paiement!'; fr = 'Erreur de vérification du paiement!'; ru = 'Ошибка проверки платежа!'"); 
		ТекстОшибки = НСтр("en = 'Le chèque doit être payé.'; es = 'Le chèque doit être payé.'; fr = 'Le chèque doit être payé.'; ru = 'Чек должен быть оплачен.'")
		+ Символы.ПС + НСтр("en = 'Spécifiez le montant du chèque de paiement.'; es = 'Spécifiez le montant du chèque de paiement.'; fr = 'Spécifiez le montant du chèque de paiement.'; ru = 'Укажите сумму платежного чека.'");
		ОбщегоНазначенияКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, ТекстОшибки);
		
		ОчиститьПоОрганизации();
		
		Возврат;
	
	КонецЕсли;
	
	ОплатаБанковскимКредитомПлатежнойКартой = 0;
	
	Для каждого СтрокаОплата Из Оплата Цикл
		Если НЕ (СтрокаОплата.ВидОплаты = ПредопределенноеЗначение("Справочник.TypesDePayment.Cash") 
			или СтрокаОплата.ВидОплаты = ПредопределенноеЗначение("Справочник.TypesDePayment.Cheque")
			или СтрокаОплата.ВидОплаты = ПредопределенноеЗначение("Справочник.TypesDePayment.VirementBanquaire")) Тогда
		
			ОплатаБанковскимКредитомПлатежнойКартой = ОплатаБанковскимКредитомПлатежнойКартой + СтрокаОплата.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если ОплатаБанковскимКредитомПлатежнойКартой > ИтогПоОрганизации Тогда
		ЗаголовокИнформации = НСтр("en = 'Erreur de vérification du paiement!'; es = 'Erreur de vérification du paiement!'; fr = 'Erreur de vérification du paiement!'; ru = 'Ошибка проверки платежа!'");
		ТекстОшибки = НСтр("en = 'Le montant du paiement par carte dépasse le montant du chèque'; es = 'Le montant du paiement par carte dépasse le montant du chèque'; fr = 'Le montant du paiement par carte dépasse le montant du chèque'; ru = 'Сумма платежа по карте превышает сумму чека'");
		
		ОбщегоНазначенияКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, ТекстОшибки);
		
		ОчиститьПоОрганизации();
		Возврат;
	КонецЕсли;
	
	СанкционированноеЗакрытие = Истина;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Действие", НСтр("en = 'Close the receipt'; fr = 'Fermer le chèque'; ru = 'Закрыть чек'; es = 'Cerrar cheque'"));
	СтруктураОтвета.Вставить("АдресТаблицыОплата", АдресТаблицыОплата());
	
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНаличные(Команда)
	
	СтрокаОплаты = ТекущиеВидыОплат.Добавить();
	
	СтрокаОплаты.ВидОплаты = ПредопределенноеЗначение("Справочник.TypesDePayment.Cash");
	СуммаКОплате = Макс(ИтогПоОрганизации - ТекущиеВидыОплат.Итог("Сумма"), 0);
	
	СтрокаОплаты.Сумма = СуммаКОплате;
	
	СтрокаОплаты.ПредставлениеСуммы      = СтрокаОплаты.Сумма;
	СтрокаОплаты.ПредставлениеВидаОплаты = "Cash";
	СтрокаОплаты.Организация             = Организация;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница;
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТекущиеВидыОплат;
	Элементы.ТекущиеВидыОплат.ТекущаяСтрока = СтрокаОплаты.ПолучитьИдентификатор();
	
	ПервыйВвод = Истина;
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКарта(Команда)
	
	//КомандаКартаКлиент();
	СтрокаОплаты = ТекущиеВидыОплат.Добавить();
	
	СтрокаОплаты.ВидОплаты = ПредопределенноеЗначение("Справочник.TypesDePayment.CarteBanquaire");
	СуммаКОплате = Макс(ИтогПоОрганизации - ТекущиеВидыОплат.Итог("Сумма"), 0);
	
	СтрокаОплаты.Сумма = СуммаКОплате;
	
	СтрокаОплаты.ПредставлениеСуммы      = СтрокаОплаты.Сумма;
	СтрокаОплаты.ПредставлениеВидаОплаты = "Carte banquaire";
	СтрокаОплаты.Организация             = Организация;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница;
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТекущиеВидыОплат;
	Элементы.ТекущиеВидыОплат.ТекущаяСтрока = СтрокаОплаты.ПолучитьИдентификатор();
	
	ПервыйВвод = Истина;
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКредит(Команда)
	
	//КомандаКартаКлиент();
	СтрокаОплаты = ТекущиеВидыОплат.Добавить();
	
	СтрокаОплаты.ВидОплаты = ПредопределенноеЗначение("Справочник.TypesDePayment.Credit");
	СуммаКОплате = Макс(ИтогПоОрганизации - ТекущиеВидыОплат.Итог("Сумма"), 0);
	
	СтрокаОплаты.Сумма = СуммаКОплате;
	
	СтрокаОплаты.ПредставлениеСуммы      = СтрокаОплаты.Сумма;
	СтрокаОплаты.ПредставлениеВидаОплаты = "Crédit";
	СтрокаОплаты.Организация             = Организация;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница;
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТекущиеВидыОплат;
	Элементы.ТекущиеВидыОплат.ТекущаяСтрока = СтрокаОплаты.ПолучитьИдентификатор();
	
	ПервыйВвод = Истина;
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСторно(Команда)
	
	ТекущаяСтрокаОплаты = Элементы.ТекущиеВидыОплат.ТекущиеДанные;
	
	УдалениеСтроки(ТекущаяСтрокаОплаты);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаБезнал(Команда)
	
	CurParameters = New Structure;
	CurParameters.Insert("Владелец",Организация);
	NotifyDescr = New NotifyDescription("ПослеВыбораСчета",ThisObject);
	OpenForm("Справочник.БанковскиеСчета.Форма.ФормаВыбора",CurParameters,,,,,NotifyDescr,FormWindowOpeningMode.LockWholeInterface);

КонецПроцедуры

&НаКлиенте
Процедура КомандаЧек(Команда)
	
	CurParameters = New Structure;
	CurParameters.Insert("Владелец",Организация);
	NotifyDescr = New NotifyDescription("ПослеВыбораПараметровЧека",ThisObject);
	OpenForm("Обработка.VentesEnDetail.Форма.ФормаПараметровЧека",CurParameters,,,,,NotifyDescr,FormWindowOpeningMode.LockWholeInterface);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_УстановитьТекущийЭлементВВидОплаты()
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.ВидыОплат;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЦифру(ВведеннаяЦифраСтрокой)
	
	ТекущаяСтрокаОплаты = Элементы.ТекущиеВидыОплат.ТекущиеДанные;
	
	Если ТекущаяСтрокаОплаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если (ТекущаяСтрокаОплаты.ЗапретРедактирования) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПервыйВвод Тогда
		ТекущаяСтрокаОплаты.ПредставлениеСуммы = "";
		ПервыйВвод = Ложь;
	КонецЕсли;
	
	Запятая = Сред(ТекущаяСтрокаОплаты.ПредставлениеСуммы, СтрДлина(ТекущаяСтрокаОплаты.ПредставлениеСуммы) - КоличествоСимволовПослеЗапятой, 1);
	
	Если НЕ Запятая = "," Тогда
		ТекущаяСтрокаОплаты.ПредставлениеСуммы = ТекущаяСтрокаОплаты.ПредставлениеСуммы + ВведеннаяЦифраСтрокой;
	КонецЕсли;
	
	СуммаОплаты = ПривестиСтрокуКЧислу(ТекущаяСтрокаОплаты.ПредставлениеСуммы, Истина);
	
	ТекущаяСтрокаОплаты.Сумма = СуммаОплаты;
	
	ОбновитьФорму();
	
КонецПроцедуры

// Функция выполняет приведение строки к числу.
// Параметры:
//  ЧислоСтрокой           - Строка - Строка приводимая к числу.
//  ВозвращатьНеопределено - Булево - Если Истина и строка содержит некорректное значение, то возвращать Неопределено.
//
// Возвращаемое значение:
//  Число
//
&НаКлиенте
Функция ПривестиСтрокуКЧислу(ЧислоСтрокой, ВозвращатьНеопределено = Ложь)
	
	ОписаниеТипаЧисла = Новый ОписаниеТипов("Число");
	ЗначениеЧисла = ОписаниеТипаЧисла.ПривестиЗначение(ЧислоСтрокой);
	
	Если ВозвращатьНеопределено И (ЗначениеЧисла = 0) Тогда
		
		Стр = Строка(ЧислоСтрокой);
		Если Стр = "" Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Стр = СтрЗаменить(СокрЛП(Стр), "0", "");
		Если (Стр <> "") И (Стр <> ".") И (Стр <> ",") Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеЧисла;
	
КонецФункции

&НаСервере
Функция АдресТаблицыОплата()
	
	АдресТаблицы = ПоместитьВоВременноеХранилище(Оплата.Выгрузить(), Новый УникальныйИдентификатор);
	
	Возврат АдресТаблицы;
	
КонецФункции // АдресТаблицыОплата()

&НаСервере
Процедура ПодготовитьТаблицыКПередаче()

	ПервыйВвод = Истина;
	
	ТаблицаТекущиеВидыОплат = ТекущиеВидыОплат.Выгрузить().Скопировать();
	КолвоЭлементовКоллекции = ТаблицаТекущиеВидыОплат.Количество();
	Для ОбратныйИндекс = 1 По КолвоЭлементовКоллекции Цикл
		ЭлементКоллекции = ТаблицаТекущиеВидыОплат[КолвоЭлементовКоллекции - ОбратныйИндекс];

		Если ЭлементКоллекции.Сумма = 0 Тогда
			
			ТаблицаТекущиеВидыОплат.Удалить(ЭлементКоллекции);
		КонецЕсли;
	КонецЦикла;
	
	ОчиститьПоОрганизацииСервер();
	
	ЗагрузитьВТаблицуЗначений(ТаблицаТекущиеВидыОплат, Оплата, Истина);
	
	ТаблицаОплаты = Оплата.Выгрузить().Скопировать();
	ТаблицаОплаты.Свернуть("ВидОплаты, Организация, Сертификат, Счет, Чек", "Сумма");
	Оплата.Загрузить(ТаблицаОплаты);
	
	КолвоЭлементовКоллекции = Оплата.Количество();
	Для ОбратныйИндекс = 1 По КолвоЭлементовКоллекции Цикл
		ЭлементКоллекции = Оплата[КолвоЭлементовКоллекции - ОбратныйИндекс];

		Если ЭлементКоллекции.Сумма = 0 Тогда
			Оплата.Удалить(ЭлементКоллекции);
		КонецЕсли;
	КонецЦикла;
	

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВТаблицуЗначений(ТаблицаИсточник, ТаблицаПриемник, ОчищатьПриемник = Ложь) Экспорт

	Если ОчищатьПриемник Тогда
		ТаблицаПриемник.Очистить();
	КонецЕсли;
	
	// Заполним значения в совпадающих колонках.
	Для Каждого СтрокаТаблицыИсточника Из ТаблицаИсточник Цикл

		СтрокаТаблицыПриемника = ТаблицаПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриемника, СтрокаТаблицыИсточника);

	КонецЦикла;

КонецПроцедуры

// Процедура заполняет таблицу "ВидыОплаты" значениями для выбора.
//
&НаСервере
Процедура ЗаполнитьТаблицуВидыОплаты(ТипОплаты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"SELECT
	|	TypesDePayment.Ref AS ВидОплаты,
	|	TypesDePayment.DataVersion AS DataVersion,
	|	TypesDePayment.DeletionMark AS DeletionMark,
	|	TypesDePayment.Code AS Code,
	|	TypesDePayment.Description AS Description,
	|	TypesDePayment.Predefined AS Predefined,
	|	TypesDePayment.PredefinedDataName AS PredefinedDataName
	|FROM
	|	Catalog.TypesDePayment AS TypesDePayment";
	
	Запрос.УстановитьПараметр("ТипОплаты", ТипОплаты);
	ТаблицаВидовОплат = Запрос.Выполнить().Выгрузить();
	
	ВидыОплат.Очистить();
	Для Каждого ТекСтрокаТаблицаВидовОплат Из ТаблицаВидовОплат Цикл
		НовСтрока = ВидыОплат.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрокаТаблицаВидовОплат);
		НовСтрока.ТипОплаты = ТипОплаты;
	КонецЦикла;
	
	СтрокаВыхода = ВидыОплат.Добавить();
	СтрокаВыхода.ВидОплаты = Справочники.TypesDePayment.ПустаяСсылка();
	СтрокаВыхода.Представление = НСтр("en = 'Back'; fr = 'En arrière'; ru = 'Назад'; es = 'Atrás'")
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()
	
	ОбщаяСуммаОплаты = ТекущиеВидыОплат.Итог("Сумма");
	
	Если ОбщаяСуммаОплаты >= ИтогПоОрганизации Тогда
		СуммаСдачи = ОбщаяСуммаОплаты - ИтогПоОрганизации;
		Элементы.КомандаEnterПраваяКлавиатура.Доступность = Истина;
		Элементы.КомандаEnter.Доступность = Истина;
		
		ЦветТекстаСдачи  = Новый Цвет(45, 115, 44);
		ЗаголовокСдачи  = НСтр("en = 'Retour'; es = 'Retour'; fr = 'Retour'; ru = 'Возвращение'");
		ПодключитьОбработчикОжидания("Подключаемый_УстановитьТекущийЭлементEnter", 0.1, Истина);
	Иначе
		СуммаСдачи = ИтогПоОрганизации - ОбщаяСуммаОплаты;
		Элементы.КомандаEnterПраваяКлавиатура.Доступность = Ложь;
		Элементы.КомандаEnter.Доступность = Ложь;
		
		ЦветТекстаСдачи = WebЦвета.Красный;
		ЗаголовокСдачи  = НСтр("en = 'Retour'; es = 'Retour'; fr = 'Retour'; ru = 'Возвращение'");
	КонецЕсли;
	
	Элементы.СуммаСдачи.ЦветТекста = ЦветТекстаСдачи;
	Элементы.СуммаСдачи.Заголовок  = ЗаголовокСдачи;
	
КонецПроцедуры

&НаКлиенте
Функция СуммаОплатПлатежнойКартой();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта"));
	
	СтрокиВидовОплат = ТекущиеВидыОплат.НайтиСтроки(СтруктураПоиска);
	
	СуммаОплатыПлатежнойКартой = 0;
	
	Для каждого СтрокаВидовОплат Из СтрокиВидовОплат Цикл
	
		СуммаОплатыПлатежнойКартой = СуммаОплатыПлатежнойКартой + СтрокаВидовОплат.Сумма;
	
	КонецЦикла;
	
	Возврат СуммаОплатыПлатежнойКартой
	
КонецФункции // СуммаОплатПлатежнойКартой()

// Обработка выбора вида оплаты;
//
// Параметры:
//  ВыбраннаяСтрока - Выбранная строка;
//
&НаКлиенте
Процедура ОбработкаВыбораВидыОплаты(ВыбраннаяСтрока)

	Если ВыбраннаяСтрока.ВидОплаты = ПредопределенноеЗначение("Справочник.TypesDePayment.EmptyRef") Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница;
	Иначе
		СуммаКОплате = Макс(ИтогПоОрганизации - ТекущиеВидыОплат.Итог("Сумма"), 0);
		
		Если СуммаКОплате = 0 Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница;
			Возврат 
		КонецЕсли;
		
		ПервыйВвод = Истина;
	КонецЕсли;
	ОбновитьФорму();
КонецПроцедуры // ОбработкаВыбораВидыОплаты()

&НаКлиенте
Процедура Подключаемый_УстановитьТекущийЭлементEnter()
	ТекущийЭлемент = Элементы.КомандаEnter;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьТекущийЭлементКнопкаЗакрыть()
	ТекущийЭлемент = Элементы.КнопкаЗакрыть;
КонецПроцедуры

&НаКлиенте
Процедура УдалениеСтроки(ТекущаяСтрокаОплаты)
	
	Если ТекущаяСтрокаОплаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипОплаты = ТекущаяСтрокаОплаты.ТипОплаты;

	ПараметрДействия = Новый Структура;
	ПараметрДействия.Вставить("ОткрытаБлокирующаяФорма"     , Ложь);
	ПараметрДействия.Вставить("ИдентификаторВыбраннойСтроки", ТекущаяСтрокаОплаты.ПолучитьИдентификатор());
	ПараметрДействия.Вставить("ЗавершитьУдалениеСтроки");
	
	Если НЕ ПараметрДействия.ОткрытаБлокирующаяФорма Тогда
		ЗавершитьУдалениеСтроки(ПараметрДействия)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьУдалениеСтроки(ПараметрДействия)
	
	ТекущаяСтрокаОплаты = ТекущиеВидыОплат.НайтиПоИдентификатору(ПараметрДействия.ИдентификаторВыбраннойСтроки);
	
	Если ТекущаяСтрокаОплаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура;
	//СтруктураПоиска.Вставить("ПодарочныйСертификат", ТекущаяСтрокаОплаты.ПодарочныйСертификат);
	//СтруктураПоиска.Вставить("СерийныйНомер"       , ТекущаяСтрокаОплаты.СерийныйНомер);
	СтруктураПоиска.Вставить("Организация"         , Организация);
	
	ТекущиеВидыОплат.Удалить(ТекущаяСтрокаОплаты);
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоОрганизации()

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Организация", Организация);
	
	СтрокиОплаты = Оплата.НайтиСтроки(СтруктураПоиска);
	
	Для каждого СтрокаОплаты Из СтрокиОплаты Цикл
		
		Оплата.Удалить(СтрокаОплаты);
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОчиститьПоОрганизацииСервер()

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Организация", Организация);
	
	СтрокиОплаты = Оплата.НайтиСтроки(СтруктураПоиска);
	
	Для каждого СтрокаОплаты Из СтрокиОплаты Цикл
		
		Оплата.Удалить(СтрокаОплаты);
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюИДоступностью()
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСертификат(Команда)
	CurParameters = New Structure;
	CurParameters.Insert("Заголовок","Inserez le numéro du Bon d'achat");
	NotifyDescr = New NotifyDescription("ПослеВводаНомераСертификата",ThisObject,"PourcentDeRemise");
	OpenForm("DataProcessor.VentesEnDetail.Form.ФормаВводаЧисла",CurParameters,,,,,NotifyDescr,FormWindowOpeningMode.LockWholeInterface);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНомераСертификата(Результат,ДопПараметры) Экспорт 
	Если Результат = Неопределено Тогда возврат; КонецЕсли;
	СуммаСертификата = ПолучитьСуммуСертификатНаСервере(Результат);
	Если СуммаСертификата = 0 Тогда
		ЗаголовокИнформации = Нстр("fr = ""Bon d'achat pas trouvé!""; ru = 'Сертификат не найден!'; en = 'The certificate was not found!'; es = 'Certificado no encontrado!'");
		ТекстОшибки = ""; //Нстр("fr = ""Bon d'achat pas trouvé!""; ru = 'Сертификат не найден!'; en = 'The certificate was not found!'; es = 'Certificado no encontrado!'");
		ОбщегоНазначенияКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, ТекстОшибки);
	Иначе
		СтрокаОплаты = ТекущиеВидыОплат.Добавить();
		
		СтрокаОплаты.ВидОплаты = ПредопределенноеЗначение("Справочник.TypesDePayment.Сертификат");
		СуммаКОплате = Макс(ИтогПоОрганизации - ТекущиеВидыОплат.Итог("Сумма"), 0);
		СуммаКОплате = Мин(СуммаКОплате,СуммаСертификата);
		СтрокаОплаты.Сумма = СуммаКОплате;
		
		СтрокаОплаты.ПредставлениеСуммы      = СтрокаОплаты.Сумма;
		СтрокаОплаты.ПредставлениеВидаОплаты = "BonDAchat";
		СтрокаОплаты.Организация             = Организация;
		СтрокаОплаты.Сертификат              = Результат.ВведенноеЧисло;
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница;
		ЭтотОбъект.ТекущийЭлемент = Элементы.ТекущиеВидыОплат;
		Элементы.ТекущиеВидыОплат.ТекущаяСтрока = СтрокаОплаты.ПолучитьИдентификатор();
		
		ПервыйВвод = Истина;
		
		ОбновитьФорму();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСчета(Результат,ДопПараметры) Экспорт 
	Если Результат = Неопределено Тогда возврат; КонецЕсли;
	СтрокаОплаты = ТекущиеВидыОплат.Добавить();
	
	СтрокаОплаты.ВидОплаты = ПредопределенноеЗначение("Справочник.TypesDePayment.VirementBanquaire");
	СуммаКОплате = Макс(ИтогПоОрганизации - ТекущиеВидыОплат.Итог("Сумма"), 0);
	СтрокаОплаты.Сумма = СуммаКОплате;
	
	СтрокаОплаты.ПредставлениеСуммы      = СтрокаОплаты.Сумма;
	СтрокаОплаты.ПредставлениеВидаОплаты = "Virement";
	СтрокаОплаты.Организация             = Организация;
	СтрокаОплаты.Счет              		 = Результат;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница;
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТекущиеВидыОплат;
	Элементы.ТекущиеВидыОплат.ТекущаяСтрока = СтрокаОплаты.ПолучитьИдентификатор();
	
	ПервыйВвод = Истина;
	
	ОбновитьФорму();

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПараметровЧека(Результат,ДопПараметры) Экспорт 
	Если Результат = Неопределено Тогда возврат; КонецЕсли;

	СтрокаОплаты = ТекущиеВидыОплат.Добавить();
	
	СтрокаОплаты.ВидОплаты = ПредопределенноеЗначение("Справочник.TypesDePayment.Cheque");
	СуммаКОплате = Макс(ИтогПоОрганизации - ТекущиеВидыОплат.Итог("Сумма"), 0);
	
	СтрокаОплаты.Сумма = Результат.СуммаЧека; //СуммаКОплате;
	
	СтрокаОплаты.ПредставлениеСуммы      = СтрокаОплаты.Сумма;
	СтрокаОплаты.ПредставлениеВидаОплаты = "Cheque";
	СтрокаОплаты.Организация             = Организация;
	СтрокаОплаты.Чек            		 = Результат.Чек;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница;
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТекущиеВидыОплат;
	Элементы.ТекущиеВидыОплат.ТекущаяСтрока = СтрокаОплаты.ПолучитьИдентификатор();
	
	ПервыйВвод = Истина;
	
	ОбновитьФорму();
	
КонецПроцедуры

Функция ПолучитьСуммуСертификатНаСервере(НомерСертификата)
	СуммаСертификата = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СертификатНаОплату.Ссылка КАК Ссылка,
	|	СертификатНаОплату.Сумма КАК Сумма
	|ИЗ
	|	Документ.СертификатНаОплату КАК СертификатНаОплату
	|ГДЕ
	|	СертификатНаОплату.Номер = &НомерСертификата
	|	И СертификатНаОплату.Реализация = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	|	И НЕ СертификатНаОплату.ПометкаУдаления";
	Запрос.УстановитьПараметр("НомерСертификата",Число(НомерСертификата.ВведенноеЧисло));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		СуммаСертификата = Выборка.Сумма;
	КонецЕсли;
	Возврат СуммаСертификата;
КонецФункции

#КонецОбласти
